Python for Data & Analytics<br>
Chapter 11, section 6

*** requires datafile: DQ-Example-IDs.csv

In [1]:
import pandas as pd
df = pd.read_csv("DQ-Example-IDs.csv")
df

    id                     email
0    1        obraund@stateu.edu
1    2      jcummings@mymail.com
2    3  lheikkinen@redletter.com
3    4       jfutrelle@epost.org
4  NaN        wallen@fivegee.net
5  six         jmoran@mymail.com
6    4        wallen@fivegee.net

In [2]:
df.email.is_unique

False

In [3]:
df['email_dup'] = df.email.duplicated(keep=False)
df

    id                     email  email_dup
0    1        obraund@stateu.edu      False
1    2      jcummings@mymail.com      False
2    3  lheikkinen@redletter.com      False
3    4       jfutrelle@epost.org      False
4  NaN        wallen@fivegee.net       True
5  six         jmoran@mymail.com      False
6    4        wallen@fivegee.net       True

In [4]:
df[df.email_dup]

    id               email  email_dup
4  NaN  wallen@fivegee.net       True
6    4  wallen@fivegee.net       True

In [5]:
df.id.isna().sum()

1

In [6]:
df[df.id.isna()][['id', 'email']]

    id               email
4  NaN  wallen@fivegee.net

In [7]:
df['id'] = df.id.astype('str')
df['id_isdigit'] = df.id.str.isdigit()
df

    id                     email  email_dup  id_isdigit
0    1        obraund@stateu.edu      False        True
1    2      jcummings@mymail.com      False        True
2    3  lheikkinen@redletter.com      False        True
3    4       jfutrelle@epost.org      False        True
4  nan        wallen@fivegee.net       True       False
5  six         jmoran@mymail.com      False       False
6    4        wallen@fivegee.net       True        True

In [8]:
df[['id']][~df.id_isdigit]

    id
4  nan
5  six

In [9]:
df['id_dup'] = df.id.duplicated(keep=False)
df[df.id_dup][['id','email']]

  id                email
3  4  jfutrelle@epost.org
6  4   wallen@fivegee.net

In [10]:
df.drop_duplicates(subset=['id'], keep=False)

    id                     email  email_dup  id_isdigit  id_dup
0    1        obraund@stateu.edu      False        True   False
1    2      jcummings@mymail.com      False        True   False
2    3  lheikkinen@redletter.com      False        True   False
4  nan        wallen@fivegee.net       True       False   False
5  six         jmoran@mymail.com      False       False   False

Code from: Python for Data & Analytics, (c) 2023 Rose River Software, LLC